Cases/sCO2Channel-DES_SpAll/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    BotWall1
    {
        type            nutUSpaldingWallFunction;
        value           1E-6;
    }    
	BotWall2
    {
        type            nutUSpaldingWallFunction;
        value           1E-6;
    }
    OtherWalls
    {
        type            nutUSpaldingWallFunction;
        value           1E-6;
    }
    Inlet
    {
        type            zeroGradient;
    }
    Outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
