Cases/sCO2Channel-DES_SpAll/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES

{
    LESModel            SpalartAllmarasIDDES;

//      delta               cubeRootVol;

      delta               IDDESDelta;  // If IDDES will be Used

      IDDESDeltaCoeffs

    {

        deltaCoeff 2;

        cw 0.15;

    }

    printCoeffs         on;

    turbulence          on;

    maxDeltaxyzCoeffs

    {

    deltaCoeff 2;

    }

IDDESDeltaCoeffs

{

   fieldMaps

    {

        nuTilda         nuTilda;

        nuSgs           nuSgs;

    }

    alphaNut        1.5;

    Cb1             0.1355;

    Cb2             0.622;

    Cw2             0.3;

    Cw3             2;

    Cv1             7.1;

    Cv2             5;

    CDES            0.65;

    ck              0.07;

    fwStar          0.424;

    cl              3.55;

    ct              1.63;

}


// ************************************************************************* //
